WELCOME = """Приветствую тебя в SlavikStore. Спасибо за покупку в нашем магазине.

Для начала вам надо сменить регион App Store на Турцию.

Если вы можете сменить регион, введите команду:
!могу

Если не можете сменить, введите команду:
!не могу

Если у вас какие-либо вопросы, вы можете вызвать продавца в чат. Для этого введите команду:
!продавец
"""


CAN_CHANGE_REGION = """Вам надо сменить регион App Store на Турцию, инструкция будет скинута ниже через пару секунд.

После успешной смены региона введите команду:
!сменил

Если у вас какие-либо вопросы, вы можете вызвать продавца в чат. Для этого введите команду:
!продавец
"""


CANNOT_CHANGE_REGION = """Опишите, пожалуйста, почему не можете сменить регион, а я пока позову продавца в чат. Он с вами свяжется и вам поможет."""


REGION_CHANGED = """После того как вы сменили регион, переходите на главный экран App Store. Нажимайте на аватарку и переходите в Redeem Code.

Коды придут через несколько минут.

На этом этапе не нужно вводить никакие команды, коды автоматически придут через несколько минут."""


CODES = """Вот ваши коды:

{codes}

Вводите их по очереди.

После того как введете коды, напишите команду:
!ввел

Если у вас какие-либо вопросы, вы можете вызвать продавца в чат. Для этого введите команду:
!продавец
"""


AFTER_INPUT_DEFAULT = """После того как ввели коды, заходите в SoundCloud с любым рабочим VPN (страна VPN любая) и оформляйте подписку GO.

Если у вас отображаются только подписки Artist, то меняйте VPN."""


FINAL = """Спасибо за заказ!

Не забудьте оставить отзыв и подтвердить заказ.

SlavikStore
"""


SELLER = """Продавец получил уведомление и скоро свяжется с вами."""


ERROR = """Произошла ошибка при обработке заказа.

Продавец уже уведомлён. Пожалуйста, ожидайте.

SlavikStore
"""
